---
kind: type
id: T:Autodesk.Revit.DB.Structure.BoundaryConditions
source: html/58a98f0e-e2e5-4c8b-bea1-8228b30f1685.htm
---
# Autodesk.Revit.DB.Structure.BoundaryConditions

An object that represents a force applied across an area.

## Syntax (C#)
```csharp
public class BoundaryConditions : Element
```